# IsBackgroundCalculationInProgress Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsBackgroundCalculationInProgress Method
Document Class See Also
---
Indicates whether there are any background calculations in progress for this document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public bool IsBackgroundCalculationInProgress()
```

Visual Basic
---
```text
Public Function IsBackgroundCalculationInProgress As Boolean
```

Visual C++
---
```text
public:
bool IsBackgroundCalculationInProgress()
```

# ### Return Value
Returns true if the document has any data calculation in progress and false otherwise.
# Remarks
When a document has background calculations in progress, users cannot perform the following operations:
  * Save/Close the document.
  * Export/Print the document.
  * Synchronize to central, in worksharing environment.
  * Create a steel element.
  * Copy/Mirror/Rotate a steel element.
  * Edit the sketch of plate element.
  * Edit a custom connection.

# See Also
Document Class
Autodesk.Revit.DB Namespace